app/controllers/api/v1/articles_controller.rb

      def index
        articles = Article.order('created_at DESC');
---
SELECT "articles".* FROM "articles" ORDER BY created_at DESC

      def show
       article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

      def create
        article = Article.new(article_params)
        if article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", nil], ["description", nil], ["created_at", "2022-10-26 01:31:03.929511"], ["updated_at", "2022-10-26 01:31:03.929511"]]